---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator
source: html/94e43dde-d2f5-1e7c-8c34-04b34ed190c1.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator

An iterator to a set of FluidTemperature from FluidType.

## Syntax (C#)
```csharp
public class FluidTemperatureSetIterator : IEnumerator<FluidTemperature>
```